---
kind: method
id: M:Autodesk.Revit.DB.RevolvedSurface.GetProfileCurve
source: html/fb30e6fc-5fbf-c96d-b66e-b22124fd6394.htm
---
# Autodesk.Revit.DB.RevolvedSurface.GetProfileCurve Method

Returns a copy of the profile curve expressed in the surface's coordinate system.

## Syntax (C#)
```csharp
public Curve GetProfileCurve()
```

## Returns
A copy of the profile curve.